{
  "id": "2015-10-11-steps-to-successfully-manage-house-project",
  "title": "11 Steps to successfully manage house project",
  "date": "2015-10-11",
  "category": "IT thoughts",
  "permalink": "/2015/10/11-steps-to-successfully-manage-house",
  "content": "<p>Recently, I have been preoccupied with the interior finishing of my house. Amidst numerous phone calls and visits to Ikea, it dawned on me that I was essentially taking on the role of a project manager, much like our bosses do in the IT world. As an agile enthusiast, I would like to share 11 lessons I&#39;ve learned from this experience.</p><h3><strong>1. Define your objectives</strong></h3>\n<p>Every project begins with ideas or formal requirements. Ideally, each plan should be testable, meaning you can determine if the outcome is what you wanted. At this stage, focus on the desired results and ensure they are feasible.</p><h3><strong>2. Choose the right team</strong></h3>\n<p>After reading a compelling blog about the importance of recruitment in IT companies and hearing horror stories from family and friends, I realized selecting the right workers is crucial. Look for internally motivated individuals who exhibit successful habits and come recommended by someone you trust. This may be challenging, but it&#39;s an investment worth making.</p><h3><strong>3. Pay for accountability, not tasks</strong></h3>\n<p>While it may sound cliché, there is a significant difference between hiring multiple teams for small jobs and one team for everything. Avoid divided responsibility at all costs to prevent wasting time assigning blame when issues arise.</p><h3><strong>4. Do not save on quality</strong></h3>\n<p>As a Quality Assurance Engineer, I may be biased, but I believe that technical debt must eventually be paid, rendering cost-saving measures futile. If something exceeds your budget, work hard to earn the necessary funds. Opting for cheaper alternatives only leads to more expensive problems down the line.</p><h3><strong>5. Focus on complex tasks, avoid micromanagement</strong></h3>\n<p>Once you&#39;ve assembled the right team, trust them to handle routine tasks. Constantly monitoring their work will only cause frustration. Instead, concentrate your efforts on challenging or creative aspects and tasks you will personally handle.</p><h3><strong>6. Facilitate direct communication</strong></h3>\n<p>When dealing with multiple parties, avoid acting as a mediator. Encourage them to communicate directly through conference calls or meetings. This approach highlights the importance of communication and efficiency.</p><h3><strong>7. Remain open to suggestions</strong></h3>\n<p>Remember, others may have better ideas. Don&#39;t assume you have all the answers.</p><h3><strong>8. Embrace creativity</strong></h3>\n<p>Resist the societal pressure to conform to mediocrity. Pursue your unique vision, even if it seems unconventional. Your team will appreciate the opportunity to work on distinctive projects that they can showcase in their portfolios.</p><h3><strong>9. Act decisively and confidently</strong></h3>\n<p>As emphasized in Robert Greene&#39;s books, don&#39;t hesitate to address problems. Delaying action only worsens the situation.<br>Remember, this is your investment and your home (possibly for your family). Act promptly and thoughtfully to command attention and respect.</p><h3><strong>10. Maintain a professional demeanor</strong></h3>\n<p>People constantly evaluate you, so it&#39;s essential to project an air of confidence and competence. Robert Ringer&#39;s Winning Through Intimidation emphasizes the importance of a strong presence in business dealings. Avoid dressing too casually in professional settings, as it may have unintended consequences.</p><h3><strong>11. Share weekly updates with your family</strong></h3>\n<p>You might be surprised to learn that sending regular reports to your family helps you stay on top of ongoing tasks and logistical challenges. These updates benefit both you and your family, who will appreciate the progress photos.</p>"
}