{
  "id": "2015-10-20-our-future-as-testers",
  "title": "Our future as testers",
  "date": "2015-10-20",
  "category": "Testing thoughts",
  "permalink": "/2015/10/our-future-as-testers",
  "content": "<p>I got inspired to write this post after watching a <a href=\"https://www.youtube.com/watch?v=7Pq-S557XQU\" target=\"_blank\" rel=\"noreferrer\">youtube video &#39;Humans need not apply&#39;</a>. The author of this rather one-sided video presents many arguments which should convince us that our jobs would soon be taken by robots and automatons. Of course, the points presented are highly exaggerated (typical media piece these days...), but it&#39;s always worth considering if our job has a bright future. So do we, as testers/QAs, have something to worry about?</p><p>Let&#39;s start with a simple question: why do companies employ a tester? They do it because it&#39;s much cheaper to detect and fix bugs found early. They don&#39;t really care about quality. They care about <a href=\"https://smallbusiness.chron.com/customer-perceived-value-23692.html\" target=\"_blank\" rel=\"noreferrer\">customer perceived value</a>. It&#39;s worth remembering that even with 99,9% unit test coverage and green seleniums bugs may somehow slip on production.<br>Unfortunately in the social media era, one celebrity tweet with our production bug (<br>btw. <a href=\"https://twitter.com/Snowden\" target=\"_blank\" rel=\"noreferrer\">Edward Snowden</a> has already 1,41M followers) may quickly ruin us. So in my opinion testers will be needed (+desired +looked for) as long as the cost of production bugs will grow. And I doubt this trend would stop soon.</p><p>On the other hand in our highly competitive society companies need to release new features very quickly. Big teams of testers don&#39;t really fit in agile methodologies. Even assuming 3-week sprints new functionalities are usually ready for the manual test at the end of the third week. In such a short time one person is more effective than a team. That&#39;s why every tester should focus on programming skills, the transformation to lower-level tests (unit, integration) is necessary. There is no alternative. The test pyramid has to look as above (notice that I included a manual test on top -<br>I still believe its the best form of testing).</p><p>Along with programming, there are other desired testers skills: scripting, UX/UI knowledge, DevOps knowledge, business domain knowledge... I recommend you to specialize in one thing, but keep a close eye on the other. Don&#39;t ignore them,<br>because there are people who wouldn&#39;t. You don&#39;t want to be recruited by your past subordinate. Do you?</p>"
}