{
  "id": "2016-03-03-learning-pathways-for-testers",
  "title": "Learning pathways for testers",
  "date": "2016-03-03",
  "categories": [
    "Testing thoughts"
  ],
  "tags": [
    "resources for testers",
    "testing",
    "motivation",
    "learning"
  ],
  "permalink": "/2016/03/learning-pathways-for-testers",
  "content": "<img src=\"/images/blog/Learning-Quotes-16-of-16.jpg\" alt=\"\">\n\n<p>Usually, when I look online for learning resources I find a lot of rankings like:</p><ul>\n<li>Top 10 blogs every tester should follow</li>\n<li>Top 5 sites every tester should know</li>\n<li>Top 20 Twitter account for every professional tester</li>\n</ul>\n<p>Almost always those ranking contain top hits from Google + one entry which happen to be closely related with the ranking source. Associating yourself with the best is really smart from a marketing perspective (and I actually may do that myself one day), but it&#39;s surely not what I was looking for. In this post, I want to provide a more thorough examination of the learning topic.</p><p>Text will contain 3 parts, which are ordered by, importance level - motivation, learning at work and learning after work. Each section contains action points to consider (same style as in <a href=\"http://awesome-bookreviews.blogspot.com/2016/03/lean-software-development-agile-toolkit.html\" target=\"_blank\" rel=\"noreferrer\">Lean Software Development: An Agile Toolkit</a>).<br>Note that those are not universal truths. You need to map them to your style of work and project reality.</p><p>You can probably apply those advices to different computer science field as well.</p><h2>Part I - Motivation</h2>\n<p>Surely the most important one. You may have the best resources available, best people around, but still, it&#39;s not enough unless you are willing to learn.</p><p><strong>Like what you&#39;re doing</strong></p><p>Robert Greene in <a href=\"http://awesome-bookreviews.blogspot.com/2016/01/mastery-robert-greene.html\" target=\"_blank\" rel=\"noreferrer\">Mastery</a> wrote &#39;<em>To master a field, you must love the field and feel a profound connection to it&#39;</em>. I can&#39;t imagine going to work every day with a negative attitude. Save yourself tortures and find a job that you like (or at least tolerate).</p><p><strong>Adopt a beginner&#39;s mind approach and don&#39;t be afraid of failure.</strong></p><p>I&#39;m always impressed by how young kids are skiing. They carefully listen to their coaches and try to adopt advice instantly with full trust. In rare cases when they fell on the ground they just stand up and start riding again. No complaints. No second thoughts. We should strive to adopt the same approach. If you are interested in this subject read Ryan Holiday&#39;s <a href=\"http://awesome-bookreviews.blogspot.com/2015/12/the-obstacle-is-way-ryan-holiday.html\" target=\"_blank\" rel=\"noreferrer\">The Obstacle Is the Way</a><br>book.</p><p><strong>Find a company which embraces learning</strong><br><br>This has a lot in common with something I wrote already on my blogs - you should always aim at working with people smarter than you. If you notice that your every change proposals are discouraged or laughed off consider changing your peers. It doesn&#39;t have to be company change, internal project switch may be good enough.</p><p><strong>Find a company that pays you well and doesn&#39;t use the money to motivate you.</strong></p><p>Do not pretend that money is not important. In my opinion, you should aim at earning above average. How to define average? It&#39;s your subjective amount of how much people on your position, with the same experience, should earn. Money shouldn&#39;t be used as a motivational carrot. As Daniel Pink wrote in his great book <a href=\"http://www.amazon.com/Drive-Surprising-Truth-About-Motivates/dp/1594484805\" target=\"_blank\" rel=\"noreferrer\">Drive</a>(add to wish list if you haven&#39;t read it already) extrinsic motivation has negative effects.</p><h2>Part II - Learning at work</h2>\n<p>Dorota Wojtałów wrote in her <a href=\"https://medium.com/@dorotawojtalow/learn-learn-learn-but-what-when-and-how-318b099d1808#.b24xj9w4i\" target=\"_blank\" rel=\"noreferrer\">Medium post</a><br>that &#39;a_t work, you have almost 8 hours of practical experiences — 8 hours which can be filled in with learning new stuff._&#39; Wholeheartedly agree. No need to add anything.</p><p><strong>Don&#39;t be afraid to step outside your comfort zone</strong></p><p>I dedicate this point to every manual tester who wants to start automating. Writing code isn&#39;t really that hard,<br>especially today when we have so many books and online resources available. Don&#39;t be afraid to pick up DevOps tasks as well. Treat it as a free learning opportunity (you&#39;ll work 8 you hours anyway, so why don&#39;t you do something new?).</p><p><strong>Try to see the world from peers eyes</strong></p><p>Most software testing books focus on testing activities only. In an Agile world we are all team members with one simple goal (remember my <a href=\"https://awesome-testing.com/2016/03/mapping-lean-principles-to-testing.html\" target=\"_blank\" rel=\"noreferrer\">last post</a>?): delivery of the right product. We should focus more on projects than testing. Ask when necessary what&#39;s expected from you.</p><p><strong>Ask for &amp; give feedback</strong></p><p>This is not easy, especially when it comes to the negative one. However, it&#39;s really beneficial for us, projects &amp; the whole company. Don&#39;t forget about positive feedback too - it may even make occasional negative ones more influential.<br>Read <a href=\"http://www.amazon.com/Nonviolent-Communication-A-Language-Life/dp/1892005034\" target=\"_blank\" rel=\"noreferrer\">Nonviolent communication</a> if you&#39;re interested in the subject.</p><p><strong>Don&#39;t procrastinate</strong></p><p>TODO... ;)</p><h2>Part III - Learning after work</h2>\n<p>Every intellectual &amp; well-paid job requires some learning after working hours. Simple as that. No exceptions here.</p><p><strong>Don&#39;t work too much</strong><br><br>It may surprise you, but <a href=\"https://lengstorf.com/overtime-hurts-productivity/\" target=\"_blank\" rel=\"noreferrer\">overtime actually decreases productivity</a>.<br>If your company has something I call &#39;overtime culture&#39; (social pressure to stay at work more than 8 hours) try to kill it by introducing new, more healthy, working trends. The same applies to read &amp; learning at home. No need to do it always. Find some time for friends, family &amp; dogs. Dogs are awesome.</p><p><strong>Make reading your habit</strong><br><br>Books are awesome too. Start reading every day, on various topics. If you are tired of technology go for something lightweight (I like post-apocalyptic books like <a href=\"http://www.amazon.com/World-War-Oral-History-Zombie/dp/0307346617\" target=\"_blank\" rel=\"noreferrer\">World War Z</a><br>or <a href=\"http://www.amazon.com/Metro-2033-Dmitry-Glukhovsky-ebook/dp/B003774XKG/ref=sr_1_1?s=books&ie=UTF8&qid=1458474296&sr=1-1&keywords=metro+2033\" target=\"_blank\" rel=\"noreferrer\">Metro 2033</a>).<br>Consistency is the key. If you read every day you will end up with the reading habit, and as Charles Duhigg wrote in <a href=\"http://www.amazon.com/The-Power-Habit-What-Business/dp/081298160X\" target=\"_blank\" rel=\"noreferrer\">&#39;The power of habit&#39;</a>they&#39;re hard to change. Take advantage of that.</p><p><strong>Expand your knowledge in various fields</strong><br><br>In one of my previous posts, I stated that <a href=\"https://awesome-testing.com/2015/11/ideal-tester-equals-3141592.html\" target=\"_blank\" rel=\"noreferrer\">ideal tester equals 3,14</a>. Keep that in mind and don&#39;t read testing books only. Expand your knowledge in programming, DevOps, management, UX, security, etc.</p><p><strong>Be critical in choosing sources you follow</strong></p><p>Our day is limited to 24 hours only. You can&#39;t follow every single resource available online and read every book. Be critical and follow the ones you consider smarter than you. Generally speaking, internationally recognized authors are almost always better than local. Read in original language (usually English) to avoid translation confusion. <a href=\"http://adventuresinqa.com/2016/03/16/reading-recommendations-54/\" target=\"_blank\" rel=\"noreferrer\">Blog aggregators</a> (top posts from last week) may be helpful here.</p>"
}