{
  "id": "2016-09-21-anniversary-post-five-benefits-of-blogging",
  "title": "Anniversary post - Five benefits of blogging",
  "date": "2016-09-21",
  "categories": [
    "Testing thoughts"
  ],
  "tags": [
    "testing thoughts"
  ],
  "permalink": "/2016/09/anniversary-post-five-benefits-of",
  "content": "<p><img src=\"/images/blog/happy-birthday-icon-33.gif\" alt=\"\" style=\"width: 100%;\"></p>\n<p>It&#39;s been a year already since I started blogging. I&#39;m really happy that both my motivation for writing and new posts<br>ideas haven&#39;t depleted (quite contrary actually).</p>\n<p>Today I&#39;d like to encourage you to write to yourself by presenting five key benefits of blogging. All of them have been<br>taken from my 1-year experience of writing <a href=\"https://www.awesome-testing.com/\" target=\"_blank\" rel=\"noreferrer\">Awesome Testing</a>.</p>\n<p><strong>Strong encouragement for reading more</strong></p>\n<p>Robert<br>Greene <a href=\"https://medium.com/@paulorrj/the-robert-greene-method-of-writing-books-e175ade04897#.jc2dbowgm\" target=\"_blank\" rel=\"noreferrer\">reads 300-400 books</a><br>to collect research material for his new non-fiction publication. In terms of blogging such extremes aren&#39;t really<br>necessary, but nevertheless, the extensive preparation phase is required. To feel confident in the described topic you<br>need to at least Google the topic thoughtfully.</p>\n<p>For example, I&#39;ll soon continue my TestOps series with Continuous Testing. Here are a few very interesting articles<br>about it available for<br>free: <a href=\"https://blog.gurock.com/continuous-delivery-testers-qa-quality/\" target=\"_blank\" rel=\"noreferrer\">Gurock</a>, <a href=\"http://www.ibm.com/developerworks/library/d-testops-continuous-test/\" target=\"_blank\" rel=\"noreferrer\">IBM</a>, <a href=\"https://www.linkedin.com/pulse/role-qa-devops-world-john-ferguson-smart\" target=\"_blank\" rel=\"noreferrer\">John Ferguson Smart</a>, <a href=\"http://sdtimes.com/testing-in-a-continuous-delivery-world/2/\" target=\"_blank\" rel=\"noreferrer\">SDtimes</a>, <a href=\"http://devops.com/2016/02/09/qa-devops-era/\" target=\"_blank\" rel=\"noreferrer\">DevOps.com</a>, <a href=\"http://www.infoq.com/resource/articles/continuous-integration-howto/en/resources/Duvall_0321336380_CH06.pdf\" target=\"_blank\" rel=\"noreferrer\">InfoQ</a>, <a href=\"https://www.cognizant.com/whitepapers/Jumpstarting-DevOps-with-Continuous-Testing-codex1719.pdf\" target=\"_blank\" rel=\"noreferrer\">Cognizant</a>.<br>This may seem a little bit intimidating at first, but you want to make sure your post is fully researched and complete.</p>\n<p><strong>Higher job market value</strong></p>\n<p>By publishing in a topic related to your job expectation you show a clear interest in the subject. Everyone knows it,<br>but almost no one follows it with an action. Talking with testers on <a href=\"https://www.meetup.com/KraQA-pl/\" target=\"_blank\" rel=\"noreferrer\">KraQA meetings</a>I<br>hear a lot of complaints regarding employers. Here is something that doesn&#39;t require managerial buy-in (unless of<br>course, you want to describe things you do at your workplace). It&#39;s easy, free, and almost always beneficial.</p>\n<p>Few words about employability. Some people say that if we are happy in our jobs we shouldn&#39;t promote ourselves in social<br>media. I strongly disagree with that. In my opinion to have full comfort and life safety we need to always think about<br>the worst possible scenario. Even from the employer&#39;s perspective, I would like to have people who want to work in my<br>company, not who have to.</p>\n<p><strong>Going to the root of the problem</strong></p>\n<p>This is something I surfaced already in point one. To describe something in your words, you need to fully understand it<br>first.<br>My <a href=\"https://awesome-testing.com/2016/02/selenium-browser-capabilities-explained.html\" target=\"_blank\" rel=\"noreferrer\">browser capabilities explained</a>is<br>a perfect example of that. The topic that seemed easy at first turned out to be hard to figure out. Most Internet<br>resources I found were outdated already. In the end, I had to<br>browse <a href=\"https://src.chromium.org/viewvc/chrome/trunk/src/chrome/common/pref_names.cc?view=markup\" target=\"_blank\" rel=\"noreferrer\">the Chromium source code</a>.</p>\n<p>By the way, I had to change the user agent in my tests at work recently and I literally googled my post to find how to<br>do<br>it. <a href=\"https://github.com/slawekradzyminski/AwesomeTesting/commit/c4a57178ede9e836c94031f43a4b19cd6afad79d\" target=\"_blank\" rel=\"noreferrer\">Here&#39;s commit</a><br>showing it for those who are interested.</p>\n<p>Skill to find and understand the root causes of bugs distinguish good testers from bad ones. By writing your posts (<br>especially technical) you improve such skill. You are simply forced to analyze the roots of everything.</p>\n<p><strong>Getting familiar with novelty</strong></p>\n<p>I know one incredibly good front-end developer with ten years+ experience in JavaScript. We were talking once about<br>rate-yourselves first recruitment (you assess your skills in the scale of 1 to 10 before the technical interview) and he<br>said he would rate his JS skill for 4-5. I thought it was a joke at first, but he explained there so many things,<br>frameworks, extensions in front-end world that you can&#39;t really comprehend it fully. He knew about their existence<br>though.</p>\n<p>By reading &amp; writing often you open yourselves for various things you don&#39;t even know exists. You end up analyzing not<br>only testing stuff but also fields closely related to it. You slowly become an all-around engineer with broad knowledge<br>about the full software engineering process. There are so many things we don&#39;t even know exists. By blogging you quickly<br>realize that. This motivates you to learn them, which in turn opens you for something new...</p>\n<p><strong>Extending your professional circles</strong></p>\n<p>As an author, you distinguish yourself from the crowd. It&#39;s much easier for such a person to make professional<br>connections (especially virtual ones). You are now no longer an anonymous member of the testing community, you start to<br>influence and expand it.</p>\n<p>When I was younger I thought that people who write and speak at conferences are superhuman. Now I know it&#39;s not true. We<br>all have capabilities to do that.</p>\n"
}