{
  "id": "2016-01-05-in-famous-testers",
  "title": "(In)famous testers",
  "date": "2016-01-05",
  "category": "Testing thoughts",
  "permalink": "/2016/01/infamous-testers",
  "content": "<img src=\"/images/blog/good-testers-guide.gif\" alt=\"\">\n\n<p>img source:<a href=\"http://leitesculinaria.com/recipe-testers\" target=\"_blank\" rel=\"noreferrer\">http://leitesculinaria.com/recipe-testers</a></p><p>So the new year of blogging has just started. I&#39;m really happy about how things stand at the moment (especially after the recent <a href=\"http://awesome-testing.blogspot.com/2015/12/blog-update.html\" target=\"_blank\" rel=\"noreferrer\">switch to Blogger</a>which cut my maintenance work to a minimum). I&#39;ll keep the same frequency of new posts (1-2 per month) on both blogs. It&#39;s good to set goals for the new year and write them down in public, so here they are:</p><p>1. Put some extra effort to make technical posts better. I had a really nice idea with <a href=\"http://awesome-testing.blogspot.com/2015/12/testing-with-ansible.html\" target=\"_blank\" rel=\"noreferrer\">Ansible</a>overview but didn&#39;t go deep enough. <a href=\"http://testdetective.com/\" target=\"_blank\" rel=\"noreferrer\">The test detective </a>seems to be doing it much better. At least for now... :)</p><p>2. Fix bug on personal www (have you found it already?).</p><p>3. Do some SEO/marketing work to make my sites easier to found. Currently, I don&#39;t advertise outside my social media pages and polish Facebook <a href=\"https://www.facebook.com/groups/TestowanieOprogramowania/\" target=\"_blank\" rel=\"noreferrer\">testing group</a>(which is worth joining btw.)</p><p>I had observed one more thing since I started blogging. My intrinsic motivation level is constantly very high. I read a lot of twists, blogs, and books which help me to keep up with the latest IT market trends.</p><p>Today I&#39;d like to write a few things about branding. You probably realised already how crucial your opinion among coworkers is. A lot of times this opinion is influenced by the predecessor in the same position. <strong>This means that we (testers/QAs) share and are responsible for the same testing brand in IT.</strong> It&#39;s in our interest to educate each other, meet, share experiences, etc.</p><p>I&#39;m mentioning this because in the book I currently read -<a href=\"http://www.amazon.com/Practices-Scaling-Lean-Agile-Development/dp/0321636406\" target=\"_blank\" rel=\"noreferrer\">Practices for Scaling Lean &amp; Agile Development</a> polish ISTQB testers have very poor press:</p><blockquote class=\"blog-quote\"><p><em>We were giving an introduction to agile development at a client in Poland. Most people appreciated the ideas we introduced but there was an unusually strong resistance from the testers—which puzzled us. At the next-day workshop we had the opportunity to dig deeper<a href=\"https://www.blogger.com/blogger.g?blogID=2701735983554560434\" target=\"_blank\" rel=\"noreferrer\"></a>into the resistance and found one difference between them and other groups...they were ISTQB-certified testers.</em></p><p></p></blockquote><p>I know there are quite a few testers who are comfortable doing manual regressions only with absolutely no desire to improve their technical skills. Unfortunately, managers sooner or later realize that this is &#39;bottleneck testing&#39;. Let Yahoo be a perfect example of how those QA departments end eventually.</p><p>In my <a href=\"https://twitter.com/s_radzyminski\" target=\"_blank\" rel=\"noreferrer\">twitter feed</a>, I shared recently nice Kate Falanga <a href=\"https://dojo.ministryoftesting.com/lessons/5-problems-in-test-and-what-we-can-do-about-them-kate-falanga\" target=\"_blank\" rel=\"noreferrer\">presentation</a> &#39;5 Problems In Test … And What We Can Do About Them&#39;. The second problem she identified are bad testers:</p><blockquote class=\"blog-quote\"><p><em>Bad actors within our craft depreciating our brand and not helping lack of understanding.</em></p><p></p></blockquote><p>So... are you a tester or a bad actor? :)</p>"
}