{
  "id": "2017-12-10-what-cia-teaches-us-about-productivity",
  "title": "What CIA teaches us about productivity",
  "date": "2017-12-10",
  "categories": [
    "Testing thoughts"
  ],
  "tags": [
    "testing thoughts"
  ],
  "permalink": "/2017/12/what-cia-teaches-us-about-productivity",
  "content": "<img src=\"/images/blog/declassified.jpg\" alt=\"\">\n\n<p>I&#39;ve done lots of code-rich posts this year which may leave some of my readers disappointed. Today there would be no code and the topic would be much broader - productivity. Christmas time favors off-topic so this post (and next one)<br>would showcase useful things that I have read in 2017.</p><p>I&#39;ll be using a CIA document that I&#39;m sure most of you haven&#39;t heard of -<br>declassified<a href=\"https://www.cia.gov/news-information/featured-story-archive/2012-featured-story-archive/CleanedUOSSSimpleSabotage_sm.pdf\" target=\"_blank\" rel=\"noreferrer\">CIA Simple Sabotage manual</a>.<br>It&#39;s addressed to agents who were supposed to recruit workforce (saboteurs) in other countries. I suggest to read every single chapter (just to learn how easily mishandling breaks things), but section 11 <em>&#39;General interference with Organizations and Production&#39;</em> is absolutely fascinating and would be the core of my post.</p><p>Each point would additionally include testing perspective explaining how to apply it in our profession.</p><p><strong>Productivity vs sabotage</strong></p><p>In the simplest possible definitions:</p><p>- productivity is a measure of the efficiency of a person, machine, factory, system, etc., in converting inputs into useful outputs,</p><p>- sabotage is intentional obstruction of an activity, or willful and malicious destruction of other&#39;s property.</p><p>To make things even simple we can say that productive employee increases company value, whereas saboteur decreases it (<br>for example by not allowing it to grow).</p><p><strong>My productivity tips vs CIA sabotage tips</strong></p><p>I&#39;ll be formulating productivity suggesting as a opposite of cited sabotage tip. Productivity &amp; active sabotage aren&#39;t of course perfect contradictions, but I&#39;m sure your experience would confirm that it is often the case.</p><p>Please do not treat them too seriously ;)</p><p><strong>Don&#39;t be afraid to make decisions</strong></p><blockquote class=\"blog-quote\"><p>Insist on doing everything through &quot;channels.&quot; Never permit short-cuts to be taken in order to expedite decisions.</p><p></p></blockquote><p>It&#39;s been proven both by Napoleon and modern military leaders (<br>see <a href=\"https://www.amazon.com/Team-Teams-Rules-Engagement-Complex/dp/1591847486\" target=\"_blank\" rel=\"noreferrer\">Team of Teams</a>) that explaining strategy to subordinates and empowering them to choose appropriate tactics is the most effective way of leading troops. The same is true for modern leadership - even the smartest person can&#39;t decide in matters they have only vague understanding.<br>It&#39;s much better to train people and fully support their decisions.</p><p>CIA shows that shrinking the numbers of people who can decide on matters creates management bottleneck and slows down productivity. Point 3 in Simple Sabotage manual is interesting too: &#39;<em>Attempt to make committees as large as possible -<br>never less than five</em>&#39;. Generally speaking in larger groups every decision process is extremely slow. Also large groups are prone to <a href=\"http://www.psysr.org/about/pubs_resources/groupthink%20overview.htm\" target=\"_blank\" rel=\"noreferrer\">groupthink</a>.</p><p>Testing perspective:</p><p>(Un)fortunately software testers have to make decisions every day. We need to decide what can be checked manually, what requires automation, what functionalities to cover before introducing new functionalities, how much invest in performance/security testing etc. Also we often have to tell developers how to test their cost in most efficient/effective way. Don&#39;t be someone who shy away from taking responsibility.</p><p><strong>Try and fail fast</strong></p><blockquote class=\"blog-quote\"><p>Advocate &quot;caution.&quot; Be &quot;reasonable&quot; and urge your fellow-conferees to be &quot;reasonable&quot; and avoid haste which might</p><p></p><p>result in embarrassments or difficulties later on.</p><p></p></blockquote><p>The<a href=\"https://www.amazon.com/Lean-Startup-Entrepreneurs-Continuous-Innovation/dp/0307887898\" target=\"_blank\" rel=\"noreferrer\">Lean startup</a> movement changed the way approach business these days. Eric Ries discusses organization performance in conditions of extreme uncertainty. The main theme of the book focuses on shortening feedback loops. Every idea should be tested before moving into full-scale development. Product doesn&#39;t have to perfect, it should just allow us to verify ideas first.<br>See <a href=\"https://www.itx.com/ITX-Blog/Article/408/Pokemon-GO-is-a-Minimal-Viable-Product\" target=\"_blank\" rel=\"noreferrer\">Pokemon GO</a> minimum viable product (MVP) story for perfect example.</p><p>Looks like CIA knew that before Eric Ries. Agency suggests their saboteurs &#39;reasonable&#39; decisions precluded by lengthy speeches (&#39;<em>Talk as frequently as possible and at great length</em>&#39;). The thing is, even after long consideration we can&#39;t be sure that our approach is good. Better to start with faulty idea and change course / iterate later then wait.</p><p>Testing perspective:</p><p>Automation effort are often thwarted by unreasonable caution. I generally agree with industry leaders that there is too much bad automation around, however it&#39;s more or less similar to every single IT project. Usually there is lots of enthusiasm at first, but at some point hurdles appear. Always. You will have to face them no matter what.</p><p><strong>Work on the most important items first</strong></p><blockquote class=\"blog-quote\"><p>In making work assignments, always sign out the unimportant jobs first. See that the important jobs are assigned to</p><p></p><p>inefficient workers of poor machines.</p><p></p></blockquote><p>Prioritization importance is omitted in so called self-help books. Their usual claim is to work like crazy (bad idea)<br>and strive to attain &#39;goal&#39; that would &#39;change your life&#39;. At some there is a realization that not everything can be done now. I suggest to ask yourself a couple of questions which proven beneficial for me:</p><ul>\n<li>Which task would add the most value to our test suite?</li>\n<li>Which task would bring the most value for our business?</li>\n<li>Which task would improve the system I work with?</li>\n<li>Which task has the highest priority for my peers?</li>\n</ul>\n<p>CIA-recruited saboteurs have actually pretty easy job in this matter. It&#39;s extremely hard to correctly prioritize endless stream of work. Always have in mind the importance of it.</p><p>Testing perspective:</p><p>Software bug enforced Chrome browser update which lead to chromedriver update necessity which lead to... It happens all the time. Tester&#39;s job is very difficult when it comes to finding out proper priorities. Is failed regression test more important than testing new feature? Is security more important than performance? I let you decide.</p><p><strong>Avoid unnecessary meetings</strong></p><blockquote class=\"blog-quote\"><p>Hold conferences when there is more critical work to be done.</p><p></p></blockquote><p>I&#39;m sure you have recently attended a meeting which you summarized as a waste of time. From my experience every non daily standup meeting that require no prior preparation is a waste of time. I don&#39;t like the usual approach that everyone should attend every meeting - it just doesn&#39;t make sense. Especially having in mind that meeting attended by more then 5 people are recommended by CIA Simple Sabotage manual (see 3a).</p><p>Testing perspective:</p><p>We are often invited for random meetings as a mysterious quality guardians. That&#39;s especially the case on test management level. The higher you go in company ladder, the more you should watch out for useless meetings.</p><p><strong>Continuously improve</strong></p><blockquote class=\"blog-quote\"><p>Work slowly. Think out ways to increase the number of movements necessary on your job: use a light hammer instead of a</p><p></p><p>heavy one, try to make a small wrench do when a big one is necessary, use little force where considerable force is</p><p></p><p>needed, and so on.&quot;</p><p></p></blockquote><p>Continuous improvement is the main ingredient of <a href=\"https://leankit.com/learn/kanban/continuous-improvement/\" target=\"_blank\" rel=\"noreferrer\">Lean organisation</a>. There are always multiple things to improve in the way we work. Even such a small things as work hours, coffee, chairs may have significant outcome on productivity.</p><p>I&#39;m sure you saw it before, but it perfectly summarizes my post. Daily 1% improvement can lead to gigantic gains,<br>whereas 1% sabotage to gigantic losses. It&#39;s scary by the way how impactful saboteurs can be.</p><img src=\"/images/blog/Nr1R3e5.png\" alt=\"\">\n\n<p>Testing perspective:</p><p>My <a href=\"http://www.awesome-testing.com/2017/01/testops-4-continuous-improvement.html\" target=\"_blank\" rel=\"noreferrer\">Continuous Improvement</a> covers this topic in detail. I believe that moving the tests on lower, faster levels is usually the highest priority improvement.</p><p><strong>Pass your knowledge</strong></p><blockquote class=\"blog-quote\"><p>Never pass on your skill and experience to a new or less skillful worker.</p><p></p></blockquote><blockquote class=\"blog-quote\"><p>When training new workers, give incomplete or misleading instructions.</p><p></p></blockquote><p>Having grasped the full content of my post you can&#39;t be surprised by teaching necessity. Complex systems are incredibly complicated (most of them are probably in <a href=\"https://en.wikipedia.org/wiki/Cynefin_framework\" target=\"_blank\" rel=\"noreferrer\">Cynefin chaos</a> domain) and new joiners just have to struggle at first.</p><p>Remember that the training completes when the trainees not only implement given improvement, but learn to find them all by themselves. The same goes for prioritization - at first tasks should be assigned, but then trainees should be able to figure priorities out by themselves.</p><p>Testing perspective:</p><p>Training testers is very important topic. Usually the job market sucks experts quickly and we are forced to hire juniors / regulars. I have written many times here that senior testers should be able to effectively pass the knowledge and coaching/mentoring skills are on high demand.</p>"
}