{
  "id": "2018-04-24-my-road-to-public-speaking-slides-from-engineering-productivity-talk",
  "title": "My road to public speaking + slides from Engineering Productivity talk",
  "date": "2018-04-24",
  "categories": [
    "Testing thoughts"
  ],
  "tags": [
    "conference",
    "public speaking",
    "testing thoughts"
  ],
  "permalink": "/2018/04/my-road-to-public-speaking-slides-from",
  "content": "<img src=\"/images/blog/microphone-298587_1280.jpg\" alt=\"\">\n\n<p>In <a href=\"https://www.amazon.com/Strategies-War-Joost-Elffers-Books/dp/0143112783\" target=\"_blank\" rel=\"noreferrer\">33 Strategies of War </a>Robert Greene starts with the most important part - self-directed warfare. In order to achieve anything in life we have to conquer own fears first. On Monday (23th of April) I had a privilege to speak about <a href=\"https://www.awesome-testing.com/2017/07/testops-5-engineering-productivity.html\" target=\"_blank\" rel=\"noreferrer\">Engineering Productivity</a> during KraQA meetup. To be honest it wasn&#39;t easy. It&#39;s fair to say that I have conquered myself there.</p><h3>Road</h3>\n<p>The story begins few years ago when I have started blogging. Things written here can be used as framework &amp; background for future talks. It opened my eyes for public speaking opportunities. I though I was ready for theoretical point of view, I saw my testing thoughts valuable for listeners, but I was afraid of big crowd looking at me.</p><p>Then out of nowhere I noticed that <a href=\"https://www.meetup.com/KraQA-pl/\" target=\"_blank\" rel=\"noreferrer\">KraQA</a>(testing meetup located in Kraków) is looking for help. At first, it wasn&#39;t meant to be a speaking opportunity platform, but I just wanted to help the initiative I like. Thanks to very friendly and relaxed atmosphere on meetups I was able to get familiar with more experienced speakers. I even managed to meet with huge part of my future audience, so I wasn&#39;t speaking to strangers on Monday.</p><p>Third and probably the most important step to my public speaking was <a href=\"http://www.vistula.edu.pl/kierunki-studiow/kontynuacja-edukacji/studia-podyplomowe/informatyka/testowanie-oprogramowania/\" target=\"_blank\" rel=\"noreferrer\">Vistula University</a>.<br>I managed to get hired there as a Java basics course lecturer. Groups there can be as high as 30 people, so I quickly gathered confidence in my speaking and teaching skills. At first, I was doing average job, but acting on good feedback I started gradual improvement.</p><h3>Feedback from my talk</h3>\n<p>Rating myself is probably a bad idea, so I&#39;ll just copy-paste results.</p><img src=\"/images/blog/knowledge.PNG\" alt=\"\">\n\n<img src=\"/images/blog/presenting.PNG\" alt=\"\">\n\n<p>Probably even with worse ratings I&#39;d be very happy, because as I said already in first paragraph it was more about conquering personal fears.</p><h3>Slides</h3>\n<p>Original slides were in polish. I translated them into English for blog readers.</p><p>*<a href=\"https://www.slideshare.net/SlawomirRadzyminski/from-productivity-to-sabotage\" target=\"_blank\" rel=\"noreferrer\" title=\"From productivity to sabotage\">From productivity to sabotage - tester in 2020</a></p>"
}