{
  "id": "2018-03-13-how-to-be-a-failure-as-a-software-tester",
  "title": "How to be a failure as a software tester",
  "date": "2018-03-13",
  "category": "Testing thoughts",
  "permalink": "/2018/03/how-to-be-failure-as-software-tester",
  "content": "<img src=\"/images/blog/failre.jpg\" alt=\"\">\n\n<p>There are multiple sources for testers who strive to excellence, but the other perspective hasn&#39;t been covered... yet. In my essay I&#39;ll try to show you how to make terrible job which can label you, your work and even your team as a FAILURE.</p><p>The list consist of few points which can&#39;t be neglected if you want to achieve miserable results in your profession.</p><p><strong>Fundamentals - mind &amp; body</strong></p><p>Every ambitious goal in your life require proper foundations. Ignoring you personal development when it comes to mind &amp; body is probably the single most important thing to do.</p><p>If you train too much, eat healthy and keep your body relaxed you are in great danger of missing sick leaves which can be used as additional holiday. Exercises have adverse effects on concentration and releasing stress. Better to keep your muscles tense and always be slightly irritated.</p><p>When it comes to mental development you may have seen certain kinds of people who advocate reading books. That&#39;s a terrible thing to do - better to keep your mind numb and never challenge it (especially with different points of view). If you happen to read, make sure it does not force you to think. There are plenty of pages or newspapers which can be used in that regard.</p><p><strong>Quality guardian</strong></p><p>Ingenious managers (who, I believe can proudly call themselves failures as well) had a brilliant idea some time ago. They decided to transfer responsibility for successful releases into testers / QAs by introducing &#39;quality guardian&#39; role. For those who don&#39;t know how it works: this person has a decisive opinion whether given software can be safely released into production.</p><p>Imagine how much power it creates for failure testers. Most of the time successful IT products are released as soon as possible in order to collect feedback and verify early version (called proof of concept - PoC). As a quality guardian you can &#39;Advocate &quot;caution.&quot; Be &quot;reasonable&quot; and urge your fellow-conferees to be &quot;reasonable&quot; and avoid haste which might result in embarrassments or difficulties later on&#39; (see my <a href=\"http://www.awesome-testing.com/2017/12/what-cia-teaches-us-about-productivity.html\" target=\"_blank\" rel=\"noreferrer\">What CIA teaches us about productivity</a> post for more ideas) to make sure releasing your software is cumbersome and slow process which require a lot of hassling and discussions. If you notice however, that particular release candidate is in very bad shape don&#39;t be afraid to release it as quickly as possible.</p><p>Make sure you always support introducing &#39;quality guardian&#39; idea into your organisation. You can advertise it as idea which frees developers from caring about quality. Be the only &#39;quality guardian&#39; in your team.</p><p><strong>Avoid technology</strong></p><p>There is a lot of unnecessary talk around &#39;technical tester&#39; concept. Apparently such person should be highly technical with a lot of computer skills. As someone who wants to achieve miserable results you should actively refute such nonsense.</p><p>You shouldn&#39;t innovate much. It&#39;s better to keep things as they stand now without any automation at all. ISTQB advocates heavy processes with a lot of documents, strategies, descriptive test cases etc. That&#39;s a way to go. Do not experiment with exploratory testing. Better to create new test cases and execute them shallowly.</p><p>As a master you can go level higher and automate things which shouldn&#39;t be automated (preferably using hard to maintain Selenium scripts on top level) and execute manually tests which can be easily automated.</p><p><strong>TestOps? What?</strong></p><p>Remember and advocate it whenever possible: test environment maintenance is not you job. If something isn&#39;t working properly (for example one of adjacent webservice is down) shout that you are blocked and you can&#39;t properly do your job. Such problems should be fixed by &#39;others&#39;, ideally poorly defined &#39;others&#39;. Do not get your hands dirty trying to fix it.</p><p>Occasionally some developers may introduce you with cheaper, easier to maintain alternatives (like <a href=\"https://github.com/SeleniumHQ/docker-selenium\" target=\"_blank\" rel=\"noreferrer\">Docker Selenium</a>). Remember: it&#39;s a trap. Do not experiment too much with such things. You may strategically say that you will check it later (remember not to commit for any date!), but in fact you won&#39;t.</p><p>Avoid Infrastructure as a Code concept. Better to keep things misconfigured on various type of servers.</p><p><strong>Team flow disruption</strong></p><p>Believe it or not, but software development is social activity. As a team member you can influence your teammates in many ways.</p><p>You shouldn&#39;t smile too much, that may lead to unnecessary positive vibes around. Better to be always in negative mood and radiate it around your open space. If something bothers you make sure you complain loudly and everybody hears what you have to say.</p><p>Do not socialise with others drinking coffee or going for a beer after work hours. Better to be loner who isn&#39;t bothered much by peers. In rare instance, if someone asks you for help do not be too eager. Keep your knowledge to yourself and don&#39;t teach anyone anything.</p><p>In lean software development there is a thing called &#39;<a href=\"http://www.leanproject.com/what-we-do/key-components/lean-tools-techniques/understanding-waste/\" target=\"_blank\" rel=\"noreferrer\">waste</a>&#39;. Make sure you understand it fully and know how to increase the amount of it. Look at your team as a complicated system and try to influence it negative way.</p><p><strong>Community perspective</strong></p><p>Few testers wants you to be active part of community. Ignore them totally, do not attend local meetups, do not write blogs, do not attend conferences, do not read technical books, do not discuss testing topics with others. Building your personal brand is a sham.</p><p>Why are you reading this post anyway? :)</p>"
}