{
  "id": "2023-04-10-exploring-selenium-bidi-functionality-a-guide-with-java-examples",
  "title": "Exploring Selenium BiDi Functionality",
  "date": "2023-04-10",
  "categories": [
    "Selenium"
  ],
  "tags": [
    "Java",
    "selenium",
    "UI testing",
    "test automation"
  ],
  "permalink": "/2023/04/exploring-selenium-bidi-functionality",
  "content": "<p><img src=\"/images/blog/selenium_logo_square_green.png\" alt=\"\"></p><p>Selenium is a widely-used open-source testing framework designed for automating web browsers and validating web applications. Initially, Selenium consisted of Selenium IDE, a plugin for record-and-playback testing, and Selenium Remote Control (RC), which allowed for browser automation using various programming languages. However, as the web grew more complex, so did the need for more advanced testing capabilities.</p><p>Selenium WebDriver was introduced as a successor to Selenium RC, providing a simpler and more efficient API for browser automation. WebDriver quickly gained traction as it enabled developers to write test scripts in multiple programming languages, including Java, C#, Ruby, and Python, and execute them across different browsers such as Chrome, Firefox, and IE.</p><p>Over the years, Selenium has become the industry standard for web application testing, thanks to its robustness, flexibility, and extensive community support. However, with the increasing complexity of modern web applications and the advent of single-page applications (SPAs), Selenium WebDriver faced certain limitations in terms of real-time communication and control over browser internals.</p><p>To address these challenges and further improve the testing experience, the Selenium project introduced the Selenium BiDi (short for Bidirectional) protocol. In the following sections, we&#39;ll explore Selenium BiDi in detail. Working Java project will be provided as an example usage.</p><h2>Selenium BiDi</h2>\n<p>Selenium BiDi, short for Selenium Bidirectional, is an exciting new addition to the Selenium ecosystem that aims to improve the way we interact with and automate web browsers. Its primary goal is to enable real-time communication between WebDriver clients and web browsers using WebSockets. This bidirectional communication allows for more efficient control and monitoring of browser activities, enabling advanced features and better performance.</p><p>One of the main benefits of using Selenium BiDi over traditional WebDriver APIs is that it provides a more powerful and flexible way of automating web browsers. In addition to the standard WebDriver commands, Selenium BiDi allows for advanced actions like executing JavaScript commands, intercepting network requests, and handling browser events in real-time.</p><p>As you can see in <a href=\"https://www.selenium.dev/documentation/webdriver/bidirectional/\" target=\"_blank\" rel=\"noreferrer\">Selenium documentation</a> there are two implementations of Selenium BiDi:</p><ul>\n<li><p><a href=\"https://chromedevtools.github.io/devtools-protocol/\" target=\"_blank\" rel=\"noreferrer\">Chrome DevTools Protocol</a> (CDP)</p></li>\n<li><p><a href=\"https://w3c.github.io/webdriver-bidi/\" target=\"_blank\" rel=\"noreferrer\">WebDriver BiDirectional Protocol</a> (WebDriver BiDi)</p></li>\n</ul>\n<p>In this blog post, we will dive into the various aspects of Selenium BiDi and showcase its capabilities using Java examples. We will explore the differences between CDP and WebDriver BiDi, understand the architecture, and demonstrate how to perform advanced actions and debugging with Selenium BiDi. By the end of this post, you will have a solid understanding of how Selenium BiDi can enhance your web automation and testing experience. So, let&#39;s get started!</p><h2>Chrome DevTools Protocol (CDP)</h2>\n<p>The <a href=\"https://chromedevtools.github.io/devtools-protocol/\" target=\"_blank\" rel=\"noreferrer\">Chrome DevTools Protocol (CDP)</a> is a powerful and versatile API that allows developers to interact with and control Google Chrome and other Chromium-based browsers programmatically. CDP provides a wide range of capabilities, such as inspecting and manipulating the DOM, monitoring network activity, emulating different devices, evaluating JavaScript expressions, and profiling performance, among others. These functionalities facilitate in-depth debugging, testing, and analysis of web applications, making CDP an essential tool for developers striving to create high-quality, performant, and reliable web experiences. CDP operates over a WebSocket-based communication channel, enabling bidirectional communication between client and browser, which allows for real-time updates and more granular control over the browser&#39;s internal workings.</p><h3>CDP support in Selenium</h3>\n<p>While Selenium offers support for Chrome DevTools Protocol (CDP), its integration can be somewhat awkward and challenging. One major issue with the CDP support in Selenium is that Java bindings need to maintain separate packages for each Chromium version. This can result in compatibility issues and increased maintenance overhead, as developers must ensure that their test scripts work correctly with the specific version of Chromium being used (see screenshot from <a href=\"https://www.javadoc.io/doc/org.seleniumhq.selenium/selenium-devtools-v111/latest/overview-summary.html\" target=\"_blank\" rel=\"noreferrer\">javadoc</a> below).</p><p><img src=\"/images/blog/dTW_B6D4YbtqekhvrURTrGLRo3RUX3U44W4n0O9E5rI5XAKNvuOYLWw3IGya8N52I2ORyzdVjo2ePVr6rlihBJUMat2xEUGplaU-uD-yLW5RIppq8ml1j-CDRvL8ys1rY3YpRyZY3K3EG1amAcQABqs=w520-h640\" alt=\"\"></p><p>Additionally, the <a href=\"https://www.selenium.dev/documentation/webdriver/bidirectional/\" target=\"_blank\" rel=\"noreferrer\">official Selenium documentation</a> highlights the drawbacks of relying on CDP for testing purposes. It states, &quot;As it is not a good idea to tie your tests to a specific version of any browser, the Selenium project recommends using WebDriver BiDi wherever possible.&quot; This recommendation underscores the importance of adopting WebDriver BiDi, which aims to provide a more standardized and future-proof solution for browser automation and testing, without the need to keep up with the ever-changing Chromium versions and their corresponding CDP APIs.</p><p>Despite the challenges associated with using CDP in Selenium, it&#39;s worth noting that integrating CDP can unlock some powerful functionalities that can significantly enhance your web application testing capabilities. For example, by leveraging CDP, you can:</p><ul>\n<li><strong>Mock the network</strong>: Simulate various network conditions and intercept HTTP requests and responses, allowing you to test how your application behaves under different network scenarios, such as slow connections, high latency, or even offline mode.</li>\n<li><strong>Listen to console/JavaScript errors</strong>: Monitor the browser console for JavaScript errors, warnings, or other logs in real-time. This can help you quickly identify and address issues in your application&#39;s code, ensuring a smooth user experience.</li>\n<li><strong>Collect <a href=\"https://stackoverflow.com/questions/48630430/i-need-more-info-about-puppeteer-page-metrics-and-queryobjects\" target=\"_blank\" rel=\"noreferrer\">performance metrics</a></strong>: Gather detailed performance data, such as rendering times, memory usage, and the number of nodes, to help you identify bottlenecks and optimize your web application&#39;s performance.</li>\n</ul>\n<p>These advanced functionalities offered by CDP can provide valuable insights into your web application&#39;s behavior, stability, and performance, making it an attractive option for developers seeking more granular control and deeper analysis of their applications. However, it&#39;s essential to weigh these benefits against the challenges of maintaining compatibility with different Chromium versions and the recommendation to use WebDriver BiDi whenever possible.</p><h3>Mocking the network</h3>\n<p>The code snippet provided demonstrates how to mock an HTTP request using Selenium, specifically by intercepting a request triggered by clicking on a &quot;here&quot; link in the application being tested. Here&#39;s a step-by-step explanation of how the mocking process works in this example:</p><pre><code class=\"hljs language-java\"><span class=\"hljs-meta\">@SuppressWarnings(&quot;resource&quot;)</span>\n<span class=\"hljs-keyword\">private</span> <span class=\"hljs-keyword\">void</span> <span class=\"hljs-title function_\">mockRequestWhichIsTriggeredByClickingOnHereLink</span><span class=\"hljs-params\">()</span> {\n    <span class=\"hljs-keyword\">new</span> <span class=\"hljs-title class_\">NetworkInterceptor</span>(\n        driver,\n        Route.matching(req -&gt; req.getUri().contains(<span class=\"hljs-string\">&quot;status_codes&quot;</span>))\n            .to(() -&gt; req -&gt; <span class=\"hljs-keyword\">new</span> <span class=\"hljs-title class_\">HttpResponse</span>()\n                .setStatus(<span class=\"hljs-number\">200</span>)\n                .addHeader(<span class=\"hljs-string\">&quot;Content-Type&quot;</span>, MediaType.HTML_UTF_8.toString())\n                .setContent(utf8String(MOCKED_RESPONSE)))\n    );\n}</code></pre><p>a) First, a new instance of <em>NetworkInterceptor</em> is created, which is responsible for intercepting and manipulating network requests and responses in the browser session controlled by the Selenium driver.</p><p>b) The <em>Route.matching()</em> method is used to define a custom route that will be intercepted. The <em>req -&gt; req.getUri().contains(&quot;status_codes&quot;)</em> lambda expression specifies that the route should match any request with a URI containing the string <em>&quot;status_codes&quot;</em>.</p><p>c) The <em>to()</em> method is then called to provide a custom response for the matched route. In this case, it defines a lambda expression <em>req -&gt; new HttpResponse()</em> that takes the intercepted request and constructs a new <em>HttpResponse</em> object.</p><p>d) The <em>HttpResponse</em> object is configured with a status code of 200 (HTTP OK), indicating a successful response. It also includes an appropriate Content-Type header (in this case, <em>MediaType.HTML_UTF_8.toString()</em>), which tells the browser that the response body contains HTML content encoded in UTF-8.</p><p>e) Finally, the setContent() method is called to set the content of the mocked response using <em>utf8String(MOCKED_RESPONSE)</em>. This method converts the <em>MOCKED_RESPONSE</em> string into a byte array with the appropriate UTF-8 encoding, which is then used as the response body.</p><p>When this method is executed, any request matching the specified route will be intercepted, and the custom response will be returned instead of the actual response from the server. This allows you to test how your application behaves when specific requests return different responses, without the need to modify the server-side implementation or configure an external mocking tool.</p><p>The whole test looks like this:</p><pre><code class=\"hljs language-plaintext\">\n    private static final String MOCKED_RESPONSE = &quot;That&#x27;s mocked response&quot;;\n\n    @BeforeEach\n    public void setUp() {\n        driver.get(&quot;https://the-internet.herokuapp.com/redirector&quot;);\n        mockRequestWhichIsTriggeredByClickingOnHereLink();\n    }\n\n    @Test\n    public void networkInterceptor() {\n        // when\n        driver.findElement(By.linkText(&quot;here&quot;)).click();\n\n        // then\n        assertThat(driver.getPageSource()).contains(MOCKED_RESPONSE);\n    }\n\n    @SuppressWarnings(&quot;resource&quot;)\n    private void mockRequestWhichIsTriggeredByClickingOnHereLink() {\n        new NetworkInterceptor(\n            driver,\n            Route.matching(req -&gt; req.getUri().contains(&quot;status_codes&quot;))\n                .to(() -&gt; req -&gt; new HttpResponse()\n                    .setStatus(200)\n                    .addHeader(&quot;Content-Type&quot;, MediaType.HTML_UTF_8.toString())\n                    .setContent(utf8String(MOCKED_RESPONSE)))\n        );\n    }\n}</code></pre><h3>Listening to javascript errors in console</h3>\n<p>The code snippet provided demonstrates how to listen for JavaScript errors in the browser console using Selenium and the Chrome DevTools Protocol (CDP). Below is an explanation of each part of the code snippet:</p><pre><code class=\"hljs language-plaintext\">\npublic class JavascriptExceptionLoggerTest extends LocalTest {\n\n    private final List&lt;JavascriptException&gt; jsExceptionsList = new ArrayList&lt;&gt;();\n\n    @BeforeEach\n    public void setUpLogger() {\n        DevTools devTools = driver.getDevTools();\n        devTools.createSession();\n        devTools.getDomains().events().addJavascriptExceptionListener(jsExceptionsList::add);\n    }\n\n    @Test\n    public void logEvents() {\n        // when\n        driver.get(&quot;http://the-internet.herokuapp.com/javascript_error&quot;);\n\n        // then\n        await().until(() -&gt; jsExceptionsList.size() &gt; 0);\n    }\n}</code></pre><p>a) Import the necessary classes and packages, including <em>org.awaitility.Awaitility.await</em> for waiting for a condition to be met before proceeding in the test.</p><p>b) Define a new class called <em>JavascriptExceptionLoggerTest</em> that extends a base test class named <em>LocalTest</em>. This base class is assumed to set up the Selenium WebDriver and other required configurations.</p><p>c) Create a new instance variable <em>jsExceptionsList</em>, which is an <em>ArrayList</em> of <em>JavascriptException</em> objects. This list will be used to store any JavaScript exceptions caught during the test execution.</p><p>d) In the <em>setUpLogger()</em> method, which is annotated with <em>@BeforeEach</em>, perform the following steps:</p><ul>\n<li>Get the <em>DevTools</em> instance from the WebDriver by calling <em>driver.getDevTools()</em>.</li>\n<li>Create a new <em>DevTools</em> session by invoking <em>devTools.createSession().</em></li>\n<li>Add a new listener for JavaScript exceptions by calling <em>devTools.getDomains().events().addJavascriptExceptionListener(jsExceptionsList::add)</em>. This listener adds any JavaScript exceptions encountered to the <em>jsExceptionsList</em>.</li>\n</ul>\n<p>e) Define the <em>logEvents()</em> test method, which is annotated with <em>@Test</em>:</p><ul>\n<li>Navigate to the target web page by calling <em>driver.get(&quot;<a href=\"http://the-internet.herokuapp.com/javascript\\_error\" target=\"_blank\" rel=\"noreferrer\">http://the-internet.herokuapp.com/javascript\\_error</a>&quot;)</em>. This page is assumed to contain a JavaScript error that will be logged in the browser console.</li>\n<li>Use the <em>await()</em> method from the Awaitility library to wait for the condition <em>jsExceptionsList.size() &gt; 0</em> to be true, meaning that at least one JavaScript exception has been logged.</li>\n</ul>\n<p>By following these steps, the JavascriptExceptionLoggerTest class will listen for JavaScript errors in the browser console and store them in the <em>jsExceptionsList</em> ArrayList. This functionality can be useful for identifying and debugging issues in your web application&#39;s JavaScript code during test execution, helping to ensure a smooth and error-free user experience.</p><h3>Gathering performance metrics</h3>\n<p>The provided code snippet demonstrates how to gather performance metrics for a web application using Selenium and the Chrome DevTools Protocol (CDP). Here&#39;s a step-by-step explanation of the code:</p><pre><code class=\"hljs language-plaintext\">\n    private List&lt;Metric&gt; metricList;\n\n    @BeforeEach\n    public void setUp() {\n        DevTools devTools = driver.getDevTools();\n        devTools.createSession();\n        devTools.send(Performance.enable(Optional.empty()));\n        metricList = devTools.send(Performance.getMetrics());\n    }\n\n    @Test\n    public void shouldCollectPerformanceMetrics() {\n        // when\n        driver.get(&quot;https://awesome-testing.com&quot;);\n\n        // then\n        metricList.forEach(PerformanceMetricsTest::logAndAssert);\n    }\n\n    private static void logAndAssert(Metric metric) {\n        log.info(&quot;{} = {}&quot;, metric.getName(), metric.getValue());\n        assertThat(metric.getValue().longValue()).isGreaterThanOrEqualTo(0);\n    }\n}</code></pre><p>a) Define a new class called <em>PerformanceMetricsTest</em> that extends a base test class named <em>LocalTest</em>. This base class is assumed to set up the Selenium WebDriver and other required configurations.</p><p>b) Create a new instance variable <em>metricList</em> of type <em>List<Metric></em>. This list will be used to store the performance metrics gathered from the browser.</p><p>c) In the <em>setUp()</em> method, which is annotated with <em>@BeforeEach</em>, perform the following steps:</p><ul>\n<li>Get the <em>DevTools</em> instance from the WebDriver by calling <em>driver.getDevTools()</em>.</li>\n<li>Create a new <em>DevTools</em> session by invoking <em>devTools.createSession()</em>.</li>\n<li>Enable the Performance domain in <em>DevTools</em> by calling <em>devTools.send(Performance.enable(Optional.empty()))</em>.</li>\n<li>Retrieve the current performance metrics by sending a <em>Performance.getMetrics()</em> command, and store the results in the <em>metricList</em>.</li>\n</ul>\n<p>d) Define the <em>shouldCollectPerformanceMetrics()</em> test method, which is annotated with <em>@Test</em>:</p><ul>\n<li>Navigate to the target web page by calling <em>driver.get(&quot;<a href=\"https://awesome-testing.com\" target=\"_blank\" rel=\"noreferrer\">https://awesome-testing.com</a>&quot;)</em>. The performance metrics will be collected for this page.</li>\n<li>Call the <em>metricList.forEach(PerformanceMetricsTest::logAndAssert)</em> method to process each metric in the <em>metricList</em>. For each metric, the <em>logAndAssert()</em> method is called.</li>\n</ul>\n<p>e) Implement the <em>logAndAssert()</em> method, which takes a Metric object as input:</p><ul>\n<li>Log the metric&#39;s name and value using <em>log.info(&quot;{} = {}&quot;, metric.getName(), metric.getValue())</em>.</li>\n<li>Assert that the metric&#39;s value is greater than or equal to 0 using <em>assertThat(metric.getValue().longValue()).isGreaterThanOrEqualTo(0)</em>.</li>\n</ul>\n<p>By following these steps, the PerformanceMetricsTest class gathers performance metrics from the browser and logs them for analysis. This functionality can help developers identify potential performance bottlenecks in their web applications, leading to improved user experience and overall application performance.</p><h2>WebDriver BiDi</h2>\n<p>WebDriver BiDi (short for Bidirectional) is a modern, standardized protocol designed to enhance browser automation capabilities and overcome the limitations of WebDriver and the Chrome DevTools Protocol (CDP). WebDriver BiDi enables real-time, bidirectional communication between the client and browser, allowing for more granular control over the browser&#39;s internal workings and improved responsiveness in automation tasks.</p><p>Some of the key features of WebDriver BiDi include:</p><ul>\n<li>Support for multiple browser vendors: Unlike CDP, which is specific to Chromium-based browsers, WebDriver BiDi aims to provide a unified and standardized API across all major browsers, such as Chrome, Firefox, Safari, and Edge. This ensures consistent automation behavior and reduces the need for browser-specific code in test scripts.</li>\n<li>Improved stability and maintainability: WebDriver BiDi addresses the maintenance challenges associated with CDP by offering a more stable and standardized API that is less likely to change with each browser release. This reduces the need to update test scripts frequently and ensures better compatibility across browser versions.</li>\n<li>Enhanced debugging capabilities: WebDriver BiDi provides a more comprehensive set of debugging tools and features, such as real-time logging, stack traces, and detailed error reporting. These features help developers identify and fix issues more efficiently, leading to improved test reliability and overall application quality.</li>\n</ul>\n<p>As explained in the <a href=\"https://developer.chrome.com/blog/webdriver-bidi/\" target=\"_blank\" rel=\"noreferrer\">Google article</a> all browser vendors are involved in the specification process. Here are some of them:</p><ul>\n<li>Apple</li>\n<li>BrowserStack</li>\n<li>Google</li>\n<li>Microsoft</li>\n<li>Mozilla</li>\n<li>Sauce Labs</li>\n</ul>\n<p>The work is mostly done in the <a href=\"https://github.com/w3c/webdriver-bidi\" target=\"_blank\" rel=\"noreferrer\">GitHub repository</a>. There are monthly meetings with all major browser vendors reporting actual progress and discussing arguable and unknown specifics. The cross-companies working group makes sure the decisions are aligned with all stakeholders.</p><p>The Draft is <a href=\"https://w3c.github.io/webdriver-bidi/\" target=\"_blank\" rel=\"noreferrer\">available here</a> and the adoption rate is <a href=\"https://wpt.fyi/results/webdriver/tests/bidi?label=experimental&label=master&aligned&view=subtest\" target=\"_blank\" rel=\"noreferrer\">visualized here</a>.</p><h3>WebDriver BiDi support in Selenium</h3>\n<p>Selenium has embraced the WebDriver BiDi protocol as a key component of its browser automation capabilities. The integration of WebDriver BiDi into Selenium aims to provide a more seamless and reliable automation experience for developers, with improved control and stability compared to using the Chrome DevTools Protocol. By adopting WebDriver BiDi, Selenium users can benefit from its advanced features and cross-browser support, ensuring more consistent and maintainable test scripts for web applications.</p><h3>Listening to JavaScript errors in console</h3>\n<p>One notable example of WebDriver BiDi&#39;s capabilities is its complete logging API, which allows developers to listen to JavaScript errors in the browser console. This feature is particularly useful for identifying and debugging issues in your web application&#39;s JavaScript code during test execution. With WebDriver BiDi, you can monitor and capture these errors in a standardized manner, regardless of the browser being used, providing a consistent and reliable approach to error detection and handling.</p><p>The following tests show how to do it:</p><pre><code class=\"hljs language-plaintext\">\n    private static final String SELENIUM_CUSTOM_PAGE = &quot;https://www.selenium.dev/selenium/web/bidi/logEntryAdded.html&quot;;\n\n    private List&lt;ConsoleLogEntry&gt; consoleLogEntries;\n    private List&lt;JavascriptLogEntry&gt; javascriptLogEntries;\n    private List&lt;JavascriptLogEntry&gt; javascriptExceptions;\n\n    @SuppressWarnings(&quot;resource&quot;)\n    @BeforeEach\n    public void setUp() {\n        consoleLogEntries = new ArrayList&lt;&gt;();\n        javascriptLogEntries = new ArrayList&lt;&gt;();\n        javascriptExceptions = new ArrayList&lt;&gt;();\n        LogInspector logInspector = new LogInspector(driver);\n        logInspector.onJavaScriptLog(log -&gt; javascriptLogEntries.add(log));\n        logInspector.onConsoleEntry(log -&gt; consoleLogEntries.add(log));\n        logInspector.onJavaScriptException(log -&gt; javascriptExceptions.add(log));\n    }\n\n    @SneakyThrows\n    @Test\n    void testListenToConsoleLog() {\n        // given\n        driver.get(SELENIUM_CUSTOM_PAGE);\n\n        // when\n        driver.findElement(By.id(&quot;consoleLog&quot;)).click();\n\n        // then\n        await().until(() -&gt; consoleLogEntries.size() == 1);\n        ConsoleLogEntry consoleLogEntry = consoleLogEntries.get(0);\n        assertThat(consoleLogEntry.getText()).isEqualTo(&quot;Hello, world!&quot;);\n        assertThat(consoleLogEntry.getRealm()).isNull();\n        assertThat(consoleLogEntry.getType()).isEqualTo(&quot;console&quot;);\n        assertThat(consoleLogEntry.getMethod()).isEqualTo(&quot;log&quot;);\n        assertThat(consoleLogEntry.getStackTrace()).isNull();\n    }\n\n    @SneakyThrows\n    @Test\n    void testListenToJavascriptLog() {\n        // given\n        driver.get(SELENIUM_CUSTOM_PAGE);\n\n        // when\n        driver.findElement(By.id(&quot;jsException&quot;)).click();\n\n        // then\n        await().until(() -&gt; javascriptLogEntries.size() == 1);\n        JavascriptLogEntry javascriptLogEntry = javascriptLogEntries.get(0);\n        assertThat(javascriptLogEntry.getText()).isEqualTo(&quot;Error: Not working&quot;);\n        assertThat(javascriptLogEntry.getType()).isEqualTo(&quot;javascript&quot;);\n        assertThat(javascriptLogEntry.getLevel()).isEqualTo(LogLevel.ERROR);\n    }\n\n    @SneakyThrows\n    @Test\n    void testListenToJavascriptErrorLog() {\n        // given\n        driver.get(SELENIUM_CUSTOM_PAGE);\n\n        // when\n        driver.findElement(By.id(&quot;jsException&quot;)).click();\n\n        // then\n        await().until(() -&gt; javascriptExceptions.size() == 1);\n        JavascriptLogEntry javascriptLogEntry = javascriptExceptions.get(0);\n        assertThat(javascriptLogEntry.getText()).isEqualTo(&quot;Error: Not working&quot;);\n        assertThat(javascriptLogEntry.getType()).isEqualTo(&quot;javascript&quot;);\n    }\n\n    @SneakyThrows\n    @Test\n    void testRetrieveStacktraceForALog() {\n        // given\n        driver.get(SELENIUM_CUSTOM_PAGE);\n\n        // when\n        driver.findElement(By.id(&quot;logWithStacktrace&quot;)).click();\n\n        // then\n        await().until(() -&gt; javascriptExceptions.size() == 1);\n        JavascriptLogEntry javascriptLogEntry = javascriptExceptions.get(0);\n        assertThat(javascriptLogEntry.getStackTrace()).isNotNull();\n        assertThat(javascriptLogEntry.getStackTrace().getCallFrames()).hasSize(4);\n    }\n}</code></pre><p>The <em>LogInspectorTest</em> class contains four test cases that demonstrate how to listen to and capture different types of log entries in a web application using WebDriver BiDi. The test cases are designed to work with Firefox, as indicated by the LocalFirefoxTest base class. The tests interact with a custom Selenium page containing buttons to trigger different types of log entries.</p><ul>\n<li><em>testListenToConsoleLog</em>: This test navigates to the custom Selenium page, clicks the &quot;consoleLog&quot; button, and listens for a console log entry. It verifies that the captured console log entry contains the expected text, realm, type, method, and stack trace.</li>\n<li><em>testListenToJavascriptLog</em>: This test navigates to the custom Selenium page, clicks the &quot;jsException&quot; button, and listens for a JavaScript log entry. It verifies that the captured JavaScript log entry contains the expected text, type, and log level.</li>\n<li><em>testListenToJavascriptErrorLog</em>: This test navigates to the custom Selenium page, clicks the &quot;jsException&quot; button, and listens for a JavaScript error log entry. It verifies that the captured JavaScript error log entry contains the expected text and type.</li>\n<li><em>testRetrieveStacktraceForALog</em>: This test navigates to the custom Selenium page, clicks the &quot;logWithStacktrace&quot; button, and listens for a JavaScript error log entry with a stack trace. It verifies that the captured JavaScript error log entry contains a non-null stack trace and the correct number of call frames.</li>\n</ul>\n<p>These tests showcase how WebDriver BiDi can be used to monitor and capture various types of log entries in a web application, providing valuable insights into the application&#39;s behavior and helping developers identify and debug issues more efficiently.</p><h2>Summary: WebDriver BiDi over CDP</h2>\n<p>As the browser automation landscape evolves, it&#39;s essential for testers to understand the long-term implications of using different protocols, such as the Chrome DevTools Protocol (CDP) and WebDriver BiDi. In the long run, it is expected that support for CDP in Selenium will diminish, as WebDriver BiDi is explicitly designed to be the future of browser automation.</p><p>WebDriver BiDi offers numerous advantages over CDP, including cross-browser support, stability, and maintainability. This makes it the preferred choice for web application testing and automation. As a result, developers should be cautious about overinvesting in CDP-based tests and instead prioritize adopting WebDriver BiDi wherever possible.</p><p>By focusing on WebDriver BiDi, developers can ensure that their test scripts remain relevant and compatible with future browser releases, reducing the need for frequent updates and maintenance. Additionally, WebDriver BiDi&#39;s standardized API allows for a more consistent automation experience across different browsers, further enhancing the reliability and robustness of your test suite.</p><p>In conclusion, while CDP has served as a valuable tool for browser automation and testing, its limitations and browser-specific nature make it less suitable for long-term use. WebDriver BiDi, on the other hand, represents the future of browser automation, with its cross-browser support and stable API. By embracing WebDriver BiDi and transitioning away from CDP, developers can ensure that their test scripts remain relevant, maintainable, and compatible with the ever-evolving world of web browsers.</p><h2>Java examples</h2>\n<p>In this blog post, I have explored various browser automation concepts, including Chrome DevTools Protocol (CDP) and WebDriver BiDi. To help you better understand and implement these concepts, I have created a repository on GitHub containing practical Java examples for both CDP and WebDriver BiDi.</p><p>You can access the repository at the following link:<br></p><ul>\n<li><a href=\"https://github.com/slawekradzyminski/seleniumjava\" target=\"_blank\" rel=\"noreferrer\">https://github.com/slawekradzyminski/seleniumjava</a></li>\n</ul>\n<p>The repository contains examples for both CDP and WebDriver BiDi, demonstrating their capabilities and usage in real-world scenarios. Please note that some of these examples require a Selenium Grid running locally. To help you set up the local Selenium Grid, I have included a <a href=\"http://docker-compose.yml\" target=\"_blank\" rel=\"noreferrer\">docker-compose.yml</a> file in the repository, which allows you to easily create a grid using <a href=\"https://www.docker.com/\" target=\"_blank\" rel=\"noreferrer\">Docker</a>.</p><p>By exploring the provided examples, you can gain hands-on experience working with CDP and WebDriver BiDi in Selenium and learn how to harness their full potential in your web application testing and automation efforts.</p>"
}